/***************************************************************************
实验名称：	数码管静态显示实验

实验模块：	STC8A核心板v2.1、主板静态显示数码管

实验接线：		STC8A核心板   -----------   主板区静态显示数码管
				       P1.0       -----------        CLK						
						   P1.1       -----------        SDA							           
						
现象描述：	数码管循环显示“0~f”

更新时间：2022.06.07
***************************************************************************/
#include "intrins.h"
#include "leds.h"


void main(void)
{
	uint8_t i = 0;
	System_Init();						//系统初始化
	LED_Init();
	while(1)
	{
		for(i = 0; i < 16; i++)//依次把tab中16个数输入进去
		{   	
			Delay_ms(50);				//调用延时程序，延时50毫秒 
			sendbyte(i); 	  		//调用发送字节的程序	
			Delay_ms(500);				//调用延时程序，延时500毫秒 
		} 
		i = 0; 
	}
}

//                                      endfile
