/***************************************************************************
实验名称：   日历时钟实验

硬件模块：   STC8A核心板-V2.1、主板区：时钟日历、12864图形液晶

硬件接线：   STC8A核心板    ----------   12864图形液晶
              P0.0~P0.7    ----------      BD0~BD7
                P2.0       ----------      CS1
                P2.1	     ----------      CS2
                P2.2       ----------      RS
                P2.3       ----------      RW
                P2.4       ----------      EN
                
             STC8A核心板   ----------    时钟日历
                P2.6       ----------      SCL
                P2.7       ----------      SDA
	
现象描述：   LCD12864显示日期时间。可以修应pcf8563.c中time_buf1的数据可以修改时间，格式为16进制，例如22年06月。0x22,0x06
            调用PCF8563_Write_Time();	即可将时间写入，写入后将写入时间函数屏蔽，断电后时间继续运行后时间继续运行
更新时间：   2022-06-07
***************************************************************************/

#include <intrins.h>
#include <system.h>
#include "lcd12864.h"
#include "pcf8563.h" 
#include "pcfiic.h"

void main(void)
{
  	System_Init();
	  LCD12864_Software_Init();			    //液晶初始化
    PCF_IIC_Hardware_Init();                //IIC硬件初始化 
    Show_Num(1,0,"8563");                   //初始界面显示
    Show_Hz(3,0,9);
    Show_Hz(4,0,10);
    Show_Hz(5,0,11);
    Show_Hz(6,0,12);
	 //PCF8563_Write_Time();					//写入时间
	while(1)
	{
		PCF8563_Read_Time();                //读取8563芯片内部寄存器时间
		PCF8563_LCD_Show_Time();            //时间显示
	}
}
