/***************************************************************************
实验名称： 脉冲编码开关实验

实验模块:  STC8A核心板V2.1、主板区：12864图形液晶、脉冲编码器

实验接线： STC8A核心板   ---------   12864图形液晶
							P2.0      ---------        CS2
							P2.1      ---------        CS1
							P2.2      ---------        RS
							P2.3      ---------        RW
							P2.4      ---------        RE		   
            P0.0~P0.7   ---------        DB0~DB8	

			    STC8A核心板   ---------    脉冲编码器
							P2.5      --------- 	     B 
							P2.6      --------- 	     A
							P2.7      --------- 	     D				
						
现象描述：	顺时针转动旋钮，lcd12864模块上显示的十六位进制数越大（最大FF）
			    逆时针转动旋钮，lcd12864模块上显示的十六位进制数越小（最大00）

使用STC-ISP下载时请注意在【硬件选项】的第一项【输入用户程序运行是的IRC频率】
软件默认是11.0592MHz	但我们程序用的都是24MHz，所以我们需要手动输入或者下拉选择
24MHz然后再点击下载即可。然后即可看到右下方窗口提示
  . 用户设定频率: 24.000MHz
  . 调节后的频率: 24.000MHz
  . 频率调节误差: 0.000%
  
更新时间：2022-06-07
***************************************************************************/

#include <intrins.h>
#include "system.h"
#include "encode.h"
#include "lcd12864.h"

void main(void)
{
	System_Init();
	Encode_Hardware_Init();
	LCD12864_Software_Init();
	Show_Num(0,1,"You Pressed it!");
	while(1)
	{
		Encode_Test();
	}
}
