/***************************************************************************************************
实验名称：简易IO扩展输入实验

实验模块：	STC8A核心板-V2.1、主板区：LED发光管、简易I/O扩展、拨动开关

实验接线：	STC8A核心板   ---------   简易I/O扩展					
						P1.0        ---------      nOE					
						P1.1        ---------      T/nR
						
						P0.0~P0.7   ---------   A0~A7(J45)
						
					STC8A核心板   ---------   LED发光管
            P2.0~P2.7   ---------   LED1~LED8(J4)					
						
				  简易I/O扩展   ---------   拨动开关
          B0~B7(J44)    ---------   SW1~SW8(J1)		
     					 
					注：请先下载程序在进行接线，否则可能会出现下载不了程序的情况，因为代码中使用了下载用的IO口
							
现象描述： 通过扩展IO读取的开关数据，在LED上显示出来

更新时间：2022.06.07
*****************************************************************************************************/
#include "intrins.h"
#include "system.h"
#include "74hc245.h"


void main(void)
{
	uint8_t a = 0;
	System_Init();			 //系统初始化
	IO_Init();
	OE = 0; 		//输出允许
	TR = 0; 		//此处设为A输出，B输入
	
	while(1)
	{
		  P0 = 0xff; 	//P0置为输入
	    a = P0;		//读取P0的值
		  P2 = a; 		//值赋给P2 
	}
}

//                                      endfile
