/***************************************************************************
实验名称：并行转串行实验

实验模块：	STC8A核心板-V2.1、主板：并行转串行、拨动开关、LED发光管

实验接线：	STC8A核心板   -----------   LED发光管
           P0.0~P0.7    -----------  LED1~LED8(J4) 
					 
					STC8A核心板   -----------   并行转串行(J7)
					   P1.0       -----------      CLK
						 P1.1       -----------      SDA
					   P1.2       -----------      SF/LD
						 
					并行转串行    -----------    LED发光管
					  1~8(J8)     -----------    SW1~SW8(J1)
						
现象描述：拨动开关SW1~SW8控制LED1~LED8的亮灭

更新时间：2022.06.07
***************************************************************************/
#include "intrins.h"
#include "system.h"
#include "74hc165.h"


void main(void)
{
	uint8_t a = 0;
	System_Init();			 //系统初始化
	GPIO_Init();
	
	while(1)
	{
	  SF = 1;			   		//锁入数据
		SF = 0;
		SF = 1;
		a = receive();
		P0 = a;
	}
}

//                                      endfile
