#include "74hc165.h"

/***********************************************
函数名称：GPIO_Init
功    能：IO口初始化
入口参数：无
返 回 值：无	        
************************************************/
void GPIO_Init(void)
{
	P0M1 = 0x00;
	P0M0 = 0xff;
	
	P1M1 = 0x02;
	P1M0 = 0xfd;
}

/***********************************************
函数名称：receive
功    能：数据接收函数
入口参数：无
返 回 值：接收数据	        
************************************************/
uint8_t receive(void) 	  
{     
	uint8_t byte = 0,c;  
	for(c = 0; c < 8; c++) 		
	{ 
		byte = byte<<1; 		//数据左移一位
		CLK = 1;
		CLK = 0;
		if(SDA) 				//收取最低位数据
		byte = byte|0x01; 		
		CLK = 1;    
	} 
	return(byte);
} 