#include "system.h"
#include "pwm.h"

/**************************************************
函数名称：Pwm1_Configure
函数说明：pwm1初始化配置函数,默认占空比50%
输入参数：	无			
返 回 值：	无			
**************************************************/
void Pwm1_Configure(void)
{
	P_SW2	= 0x80;			//开启特殊功能寄存器
	PWMCKS	= 0x00;			//PWM时钟为系统时钟
	PWMC	= 18;			//设置PWM周期为36个PWM时钟
	PWM1T1	= 18;			//在计数值为36方输出低电平
	PWM1T2	= 9;			//在计数值为18的地方输出高电平
	PWM1CR	= 0x88;			//使能PWM1输出，通道P1^1
	P_SW2	= 0x00;			//关闭特殊功能寄存器
	PWMCR	= 0x80;			//暂时不启动PWM模块
	P1_Mode_OUT_PP(PIN_1);	//设置P1^1推挽输出
}



//                                      endfile
