#include "lcd1602.h"

/***********************************************
函数名称：LCD1602_GPIO_Init
功    能：GPIO初始化
入口参数：无
返 回 值：无	       
************************************************/
void LCD1602_GPIO_Init(void)
{
  P0_Mode_OUT_PP(0xFF);	//设置P0端口为推挽输出模式
	P1_Mode_OUT_PP(0x07);	//设置P1.0~P1.2端口为推挽输出模式
}

/***********************************************
函数名称：LCD1602Write_data
功    能：向LCD1602写数据
入口参数：i  数据
返 回 值：无	       
************************************************/
void LCD1602Write_data(uint8_t i)	//LCD1602写数据
{
	
	RS = 1;//数据
	RW = 0;//写入
	P0 = i;
	E = 1;//允许
	Delay_ms(5);
	E = 0;
              
}

/***********************************************
函数名称：LCD1602Write_com
功    能：向LCD1602写指令
入口参数：i  指令
返 回 值：无	       
************************************************/
void LCD1602Write_com(uint8_t i)	//LCD1602写指令
{

	RS = 0; //指令
	RW = 0; //写入
	P0 = i;
	E = 1;  //允许写入
  Delay_ms(5);
	E = 0;          
}

/***********************************************
函数名称：LCD1602_Init
功    能：LCD1602初始化
入口参数：无
返 回 值：无	       
************************************************/
void LCD1602_Init(void)		 //LCD1602初始化
{
	LCD1602_GPIO_Init();  // IO口初始化
	RW = 0;
	RS = 0;
	LCD1602Write_com(0x01);
	LCD1602Write_com(0x38);
	LCD1602Write_com(0x0c);		//无光标
	LCD1602Write_com(0x06);	
}