/***************************************************************************
实验名称：并行DA转换实验

实验模块：	STC8A核心板-V2.1、主板区：并行D/A转换

实验接线：	STC8A核心板   -----------   并行D/A转换
            P0.0        -----------      CS
						P0.1        -----------      WR
						P0.2        -----------      ILE
						P0.3        -----------      XFER
			    P1.0~P1.7     -----------      D0~D7(J19)
						
现象描述：使用示波器观察J20口的OUT输出周期性正弦波

更新时间：2022.06.07
***************************************************************************/
#include "intrins.h"
#include "system.h"
#include "dac0832.h"

void main(void)
{
	
	System_Init();			 //系统初始化
	DAC_Init();
	P1=0xff;	
	
	while(1)
	{
	   sin();
	}
}

//                                      endfile
