#include "system.h"
#include "8255io.h"

/**************************************************
函数名称：IO_8255_Init
函数说明：IO口初始化
输入参数：	无			
返 回 值：	无			
**************************************************/
void IO_8255_Init(void)
{
	P3_Mode_OUT_PP(0x1F);//推挽输出
}

/**************************************************
函数名称：Data_8255_In
函数说明：8255输入配置
输入参数：	无			
返 回 值：	无			
**************************************************/
void Data_8255_In(void)
{
	
	P2_Mode_HighZ(PIN_ALL);//输入

}

/**************************************************
函数名称：Data_8255_In
函数说明：8255输出配置
输入参数：	无			
返 回 值：	无			
**************************************************/
void Data_8255_Out(void)
{
	P2_Mode_OUT_PP(PIN_ALL);//推挽输出
}

/**************************************************
函数名称：Write_8255
函数说明：8255写入IO配置
输入参数：	无			
返 回 值：	无			
**************************************************/
void Write_8255(char x,uint8_t y)
{
	  Data_8255_Out();
    if(x==0)//写端口A
    {
        CS_ =0;
        A1_ = 0;
        A0_ = 0;
        RD_ = 1;
        DATA_IO = y;
        WR_ = 0;
        Delay_ms(10);
        WR_ = 1;
    }
    if(x==1)//写端口B
    {
        CS_=0;
        A1_ = 0;
        A0_ = 1;
        RD_ = 1;
		DATA_IO = y;
		WR_ = 0;
        Delay_ms(10);
        WR_ = 1;
		
    }
    if(x==2)//写端口C
    {
        CS_=0;
        A1_ = 1;
        A0_ = 0;
        RD_ = 1;
        DATA_IO = y;
        WR_ = 0;
        Delay_ms(10);
        WR_ = 1;
    }
    if(x==3)//写控制寄存器
    {
		CS_=0;
        A1_ = 1;
        A0_ = 1;
        RD_ = 1;	
		DATA_IO=y;
        WR_ = 0;
		Delay_ms(10);
		WR_ = 1;
    }
}

/**************************************************
函数名称：Read_8255
函数说明：8255读命令
输入参数：	无			
返 回 值：	无			
**************************************************/
 uint8_t Read_8255(char x)
{	
	uint8_t Y;
	Data_8255_In();
    if(x==0)//读端口A
    {
        CS_ = 0;
        A1_ = 0;
        A0_ = 0;
		WR_= 1;
		RD_= 0;
		Delay_ms(10);
		Y = DATA_IO;
		RD_ = 1;	
    }
    if(x==1)//读端口B
    {

        CS_=0;
        A1_ = 0;
        A0_ = 1;
        WR_ = 1;
        RD_ = 0;
        Delay_ms(10);
		Y = DATA_IO;
        RD_ = 1;
    }
    if(x==2)//读端口C
    {
        CS_ = 0;
        A1_ = 1;
        A0_ = 0;
        WR_ = 1;
        RD_ = 0;
        Delay_ms(10);
		Y = DATA_IO;
        RD_ = 1;
    }
	return Y;
}
