/***************************************************************************
实验名称：  图形液晶显示实验

实验模块:   STC8A核心板-V2.1、主板区 12864 图形液晶显示

实验接线：  STC8A核心板   ----------   12864图形液晶显示
						P0.0~P0.7    ----------      BD0~BD7
							P2.0	     ----------       CS1
							P2.1	     ----------       CS2
							P2.2       ----------       RS
							P2.3       ----------       RW
							P2.4       ----------       EN
					
现象描述： LCD12864显示计数

更新时间:  2022-06-06
***************************************************************************/

#include <intrins.h>
#include <system.h>
#include "lcd12864.h"
#include "stdio.h" 

void main(void)
{
	int i = 0;
	char show[9]={0};
	System_Init();
	LCD12864_Software_Init();			    //液晶初始化
	Show_Num(4,1,"LCD12864");
	Show_Num(2,3,"NUM:");
	while(1)
	{
		i++;
		sprintf(show,"%5d",i);
		Show_Num(8,3,show);
		if(i>9999)
		{
			i=0;
		}
		Delay_ms(100);
	}
}
