/***************************************************************************
实验名称：简易IO扩展输出实验

实验模块：	STC8A核心板-V2.1、主板区：LED发光管、简易I/O扩展

实验接线：	STC8A核心板   ---------   简易I/O扩展					
						P1.0        ---------      nOE					
						P1.1        ---------      T/nR
						
						P0.0        ---------      A0
						P0.1        ---------      A1
						P0.2        ---------      A2
						P0.3        ---------      A3
						P0.4        ---------      A4
						P0.5        ---------      A5
						P0.6        ---------      A6
						P0.7        ---------      A7
						
				  简易I/O扩展   ---------   LED发光管				
							B0        ---------    LED1
							B1        ---------    LED2
							B2        ---------    LED3
							B3        ---------    LED4
							B4        ---------    LED5
							B5        ---------    LED6
							B6        ---------    LED7
							B7        ---------    LED8
					注：请先下载程序在进行接线，否则可能会出现下载不了程序的情况，因为代码中使用了下载用的IO口
							
现象描述： LED灯显示01010101数据

更新时间：2022.06.07
***************************************************************************/
#include "intrins.h"
#include "system.h"
#include "74hc245.h"


void main(void)
{
	
	System_Init();			 //系统初始化
	IO_Init();
	OE = 0; 		//输出允许
	TR = 1; 		//置为A输入，B输出
	P0 = 0x55;
	
	while(1)
	{
	  
	}
}

//                                      endfile
