/***************************************************************************
实验名称：	  串行转并行（移位寄存器）实验

实验模块:  	STC8A核心板-V2.1、主板区：串行转并行、主板区：LED发光管

实验接线： 	STC8A核心板   ---------    串行转并行
								P2.1	    ---------   	 SCL	
								P2.0	    ---------	     SDA		
			      串行转并行    ---------    LED发光管
								1		      ---------	    LED1
								2		      ---------	    LED2
								3		      ---------	    LED3
								4		      ---------	    LED4
								5		      ---------	    LED5
								6		      ---------	    LED6
								7		      ---------	    LED7
								8		      ---------	    LED8			
			
现象描述：	LED发光管显示流水灯

   使用STC-ISP下载时请注意在【硬件选项】的第一项【输入用户程序运行是的IRC频率】
软件默认是11.0592MHz	但我们程序用的都是24MHz，所以我们需要手动输入或者下拉选择
24MHz然后再点击下载即可。然后即可看到右下方窗口提示
  . 用户设定频率: 24.000MHz
  . 调节后的频率: 24.000MHz
  . 频率调节误差: 0.000%
  
更新时间：2022-06-07
***************************************************************************/
#include <intrins.h>
#include "system.h"
#include "serial2parallel.h"

void main(void)
{
	unsigned char a=0xfe;
	System_Init();
	Serial_Hardware_Init();
    
	while(1)
	{
		a = _cror_(a,1);     	//实现输出_cror_相当于右移 _crol_相当于左移
		Serial2Parallel(a);
		Delay_ms(500);
	}
}
