/***************************************************************************
实验名称：串行AD转换实验

实验模块：	STC8A核心板-V2.1、主板区：串行A/D转换、12864图形液晶

实验接线：	STC8A核心板   -------------   12864图形液晶   	
              P2.0      -------------       CS1
							P2.1      -------------       CS2
							P2.2      -------------       RS
							P2.3      -------------       RW
							P2.4      -------------       RE		   
         P0.0~P0.7      -------------       DB0~DB7		
				 
				  STC8A核心板   -------------   串行A/D转换
					    P1.0      -------------       CLK
							P1.1      -------------       SDA
							P1.2      -------------       CS
						                               
现象描述：转动串行A/D转换的电位器(R33)改变输出电压，lcd2864显示采集的电压。

更新时间：2022.06.07
***************************************************************************/
#include "intrins.h"
#include "system.h"
#include "lcd12864.h"
#include "adc.h"
#include "stdio.h"

void main(void)
{
	float vol = 0;
	char show[17]={0};
	System_Init();			 //系统初始化
	ADC_Init();
	LCD12864_Software_Init();           //液晶初始化
	
	while(1)
	{
	  vol=read()*5/255;//读取转换数据	
		sprintf(show,"   Vol: %3.1fV  ",vol);
		Show_Num(0,4,show);
		Delay_ms(500);
	}
}

